# Brewfile list of brew and tap
# All Cask Applications
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"


brew "github-keygen"
brew "gnupg"
brew "pinentry-mac"
brew "stow"
brew "mas"
brew "gh"
cask "atom"
cask "carbon-copy-cloner"
cask "atom"
cask "typora"

# NerdFonts
cask "iterm2"
cask "visual-studio-code"
cask "warp"
cask "brave-browser"
cask "1password"
cask "rectangle"
cask "gitkraken"
cask "find-any-file"
cask "filezilla"
cask "telegram"
cask "caffeine"
cask "android-file-transfer"
cask "google-chrome"
cask "vlc"
cask "transmission"
cask "cheatsheet"
cask "spotify"
cask "spotify-now-playing"
cask "hammerspoon"
cask "openinterminal"
cask "dozer"
cask "postman"
cask "keka"
cask "keycastr"
cask "mousepose"



cask "android-studio"
cask "genymotion"

cask "flutter"



brew "# Needed Tools"
brew "mas"
brew "cocoapods"
brew "php"
brew "java"



brew "# Python3"
brew "boost-python3"

brew "# Good tools"
brew "diff-so-fancy"
brew "ranger"
brew "fzf"
brew "discord"
brew "github"
brew "sf-symbols"
brew "alfred"
brew "appcleaner"
brew "balenaetcher"
brew "ffmpeg"
brew "colortail"
brew "cmatrix"
brew "figlet"
